RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/csdidac/cy_csdidac.h
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>The \ref CY_CSDIDAC_HW_FAILURE  and
*         the \ref CY_CSDIDAC_BAD_CONFIGURATION return status cases are added
*         to the \ref cy_en_csdidac_status_t enumeration type</td>
*     <td>User experience improvement</td>
*   </tr>
*   <tr>
*     <td>The \ref CY_CSDIDAC_AB choosing case for both IDACs is added
*         to the \ref cy_en_csdidac_choice_t enumeration type</td>
*     <td>Feature enchancement</td>
*   </tr>
*   <tr>
*     <td>The CSDIDAC MW sources are enclosed with the conditional compilation to
*         ensure a successful compilation for non-CapSense-capable devices</td>
*     <td>Compilation for non-CapSense-capable devices</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>The initial version</td>
*     <td></td>
*   </tr>
* </table>
*
********************************************************************************
* \section group_csdidac_more_information More Information
********************************************************************************
*
* Important information about the CapSense-technology overview, appropriate
* device for the design, CapSense system and sensor design guidelines,
* different interfaces and tuning guidelines necessary for a successful design
* of a CapSense system is available in the Getting Started with CapSense
* document and the product-specific CapSense design guide. It is highly
* recommended to start with these documents. They can be found at www.cypress.com.
*
* For more information, refer to the following documents:
*
* * CapSense and CSDIDAC Overview:
*
*   * <a href="https://github.com/cypresssemiconductorco/mbed-os-example-csdidac"><b>CSDIDAC Middleware
*     Code Example for MBED OS</b></a>
*
*   * <a href="https://cypresssemiconductorco.github.io/capsense/capsense_api_reference_manual/html/index.html">
*     <b>CapSense Middleware API Reference Guide</b></a>
*
* * ModusToolbox Overview:
*
*   * <a href="https://www.cypress.com/products/modustoolbox-software-environment">
*     <b>ModusToolbox Software Environment, Quick Start Guide, Documentation,
*     and Videos</b></a>
*
*   * <a href="https://www.cypress.com/ModusToolboxDeviceConfig"><b>ModusToolbox
*     Device Configurator Tool Guide</b></a>
*
* * Kits:
*
*   * <a href="https://www.cypress.com/documentation/development-kitsboards/cy8ckit-145-40xx-psoc-4000s-capsense-prototyping-kit">
*     <b>CY8CKIT-145-40XX PSoC 4000S CapSense Prototyping Kit</b></a>
*
*   * <a href="https://www.cypress.com/documentation/development-kitsboards/cy8ckit-149-psoc-4100s-plus-prototyping-kit">
*     <b>CY8CKIT-149 PSoC 4100S Plus Prototyping Kit</b></a>
*
*   * <a href="https://www.cypress.com/documentation/development-kitsboards/cy8ckit-041-psoc-4-s-series-pioneer-kit">
*     <b>CY8CKIT-041-40XX PSoC 4 S-Series Pioneer Kit</b></a>
*
*   * <a href="https://www.cypress.com/documentation/development-kitsboards/cy8ckit-041-41xx-psoc-4100s-capsense-pioneer-kit">
*     <b>CY8CKIT-041-41XX PSoC 4100S CapSense Pioneer Kit</b></a>
*
*   * <a href="https://www.cypress.com/documentation/development-kitsboards/psoc-6-ble-pioneer-kit-cy8ckit-062-ble">
*     <b>CY8CKIT-062-BLE PSoC 6 BLE Pioneer Kit</b></a>
*
*   * <a href="https://www.cypress.com/documentation/development-kitsboards/psoc-6-wifi-bt-pioneer-kit-cy8ckit-062-wifi-bt">
*     <b>CY8CKIT-062-WiFi-BT PSoC 6 WiFi-BT Pioneer Kit</b></a>
*
*   * <a href="https://www.cypress.com/documentation/development-kitsboards/psoc-6-wi-fi-bt-prototyping-kit-cy8cproto-062-4343w">
*     <b>CY8CPROTO-062-4343W PSoC 6 Wi-Fi BT Prototyping Kit</b></a>
*
* * General Information:
*
*   * <a href="https://github.com/cypresssemiconductorco.github.io/psoc4pdl/pdl_api_reference_manual/html/index.html">
*     <b>PSoC 4 PDL API Reference</b></a>
*
*   * <a href="https://github.com/cypresssemiconductorco/psoc6pdl">
*     <b>PSoC 6 PDL API Reference</b></a>
*
*   * <a href="https://www.cypress.com/documentation/technical-reference-manuals/psoc-6-mcu-psoc-63-ble-architecture-technical-reference">
*     <b>PSoC 6 Technical Reference Manual</b></a>
*
*   * <a href="http://www.cypress.com/ds218787">
*     <b>PSoC 63 with BLE Datasheet Programmable System-on-Chip datasheet</b></a>
*
*   * <a href="https://www.cypress.com/documentation/technical-reference-manuals/psoc-4000s-family-psoc-4-architecture-technical-reference">
*     <b>PSoC 4000S Family: PSoC 4 Architecture Technical Reference Manual (TRM)</b></a>
*
*   * <a href="https://www.cypress.com/documentation/technical-reference-manuals/psoc-4100s-and-psoc-4100s-plus-psoc-4-architecture">
*     <b>PSoC 4100S and PSoC 4100S Plus: PSoC 4 Architecture Technical Reference Manual (TRM)</b></a>
*
*   * <a href="https://github.com/cypresssemiconductorco"><b>
*     Cypress Semiconductor GitHub</b></a>
*
*   * <a href="http://www.cypress.com"><b>Cypress Semiconductor</b></a>
*
* \note
* The links to another software component's documentation (middleware and PDL)
* point to GitHub to the latest available version of the software.
* To get documentation of the specified version, download from GitHub and unzip
* the component archive. The documentation is available in the <i>docs</i> folder.
*
* \defgroup group_csdidac_macros Macros
* \brief
* This section describes the CSDIDAC macros. These macros can be used for
* checking a maximum IDAC code and a maximum IDAC output current.
* For detailed information about macros, see each macro description.
*
* \defgroup group_csdidac_enums Enumerated types
* \brief
* Describes the enumeration types defined by the CSDIDAC. These enumerations
* can be used for checking CSDIDAC functions' return status,
* for defining a CSDIDAC LSB and polarity, and for choosing IDAC for an
* operation and defining its states.  For detailed information about
* enumerations, see each enumeration description.
*
* \defgroup group_csdidac_data_structures Data Structures
* \brief
* Describes the data structures defined by the CSDIDAC. The CSDIDAC
* middleware use structures for output channel pins,
* middleware configuration, and context. The pin structure is included
* in the configuration structure and both of them can be defined by the
* user with the CSD personality in the Device Configurator or manually
* if the user doesn't use ModusToolbox.
* The context structure contains a copy of the configuration structure
* and current CSDIDAC middleware state data. The context
* structure should be allocated by the user and be passed to all
* CSDIDAC middleware functions. CSDIDAC middleware structure sizes
* are shown in the table below:
*
* <table class="doxtable">
*   <tr><th>Structure</th><th>Size in bytes (w/o padding)</th></tr>
*   <tr>
*     <td>cy_stc_csdidac_pin_t</td>
*     <td>5</td>
*   </tr>
*   <tr>
*     <td>cy_stc_csdidac_config_t</td>
*     <td>23</td>
*   </tr>
*   <tr>
*     <td>cy_stc_csdidac_context_t</td>
*     <td>31</td>
*   </tr>
* </table>
*
* \defgroup group_csdidac_functions Functions
* \brief
* This section describes the CSDIDAC Function Prototypes.
*/

/******************************************************************************/


#if !defined(CY_CSDIDAC_H)
#define CY_CSDIDAC_H

#include "cy_device_headers.h"
#include "cy_csd.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2))

